In [1]:
import pandas as pd
import datetime
import mysql.connector

In [5]:
cnx = mysql.connector.connect(user='root', password='Choh9ohW',
                              host='127.0.0.1',
                              database='employees')

In [3]:
cursor = cnx.cursor()

query = ("SELECT first_name, last_name, hire_date FROM employees "
         "WHERE hire_date BETWEEN %s AND %s")

hire_start = datetime.date(1980, 1, 1)
hire_end = datetime.date(1999, 12, 31)

cursor.execute(query, (hire_start, hire_end))

for (first_name, last_name, hire_date) in cursor:
  print("{}, {} was hired on {:%d %b %Y}".format(
    last_name, first_name, hire_date))

cursor.close()

Facello, Georgi was hired on 26 Jun 1986
Simmel, Bezalel was hired on 21 Nov 1985
Bamford, Parto was hired on 28 Aug 1986
Koblick, Chirstian was hired on 01 Dec 1986
Maliniak, Kyoichi was hired on 12 Sep 1989
Preusig, Anneke was hired on 02 Jun 1989
Zielinski, Tzvetan was hired on 10 Feb 1989
Kalloufi, Saniya was hired on 15 Sep 1994
Peac, Sumant was hired on 18 Feb 1985
Piveteau, Duangkaew was hired on 24 Aug 1989
Sluis, Mary was hired on 22 Jan 1990
Bridgland, Patricio was hired on 18 Dec 1992
Terkki, Eberhardt was hired on 20 Oct 1985
Genin, Berni was hired on 11 Mar 1987
Nooteboom, Guoxiang was hired on 02 Jul 1987
Cappelletti, Kazuhito was hired on 27 Jan 1995
Bouloucos, Cristinel was hired on 03 Aug 1993
Peha, Kazuhide was hired on 03 Apr 1987
Haddadi, Lillian was hired on 30 Apr 1999
Warwick, Mayuko was hired on 26 Jan 1991
Erde, Ramzi was hired on 10 Feb 1988
Famili, Shahaf was hired on 22 Aug 1995
Montemayor, Bojan was hired on 17 Dec 1989
Pettey, Suzette was hired on 19 May 1997
Heyers, Prasadram was hired on 17 Aug 1987
Berztiss, Yongqiao was hired on 20 Mar 1995
Reistad, Divier was hired on 07 Jul 1989
Tempesti, Domenick was hired on 22 Oct 1991
Herbst, Otmar was hired on 20 Nov 1985
Demeyer, Elvis was hired on 17 Feb 1994
Joslin, Karsten was hired on 01 Sep 1991
Reistad, Jeong was hired on 20 Jun 1990
Merlo, Arif was hired on 18 Mar 1987
Swan, Bader was hired on 21 Sep 1988
Chappelet, Alain was hired on 05 Sep 1988
Portugali, Adamantios was hired on 03 Jan 1992
Makrucki, Pradeep was hired on 05 Dec 1990
Lortz, Huan was hired on 20 Sep 1989
Brender, Alejandro was hired on 19 Jan 1988
Meriste, Weiyi was hired on 14 Feb 1993
Lenart, Uri was hired on 12 Nov 1989
Stamatiou, Magy was hired on 21 Mar 1993
Tzvieli, Yishay was hired on 20 Oct 1990
Casley, Mingsen was hired on 21 May 1994
Shanbhogue, Moss was hired on 02 Sep 1989
Rosenbaum, Lucien was hired on 20 Jun 1992
Nyanchama, Zvonko was hired on 31 Mar 1989
Syrotiuk, Florian was hired on 24 Feb 1985
Tramer, Basil was hired on 04 May 1992
Dredge, Yinghua was hired on 25 Dec 1990
Caine, Hidefumi was hired on 15 Oct 1992
Nitsch, Heping was hired on 21 May 1988
Zschoche, Sanjiv was hired on 04 Feb 1986
Schueller, Mayumi was hired on 13 Mar 1995
Dredge, Georgy was hired on 27 Apr 1992
Bernini, Brendon was hired on 01 Feb 1990
Callaway, Ebbe was hired on 15 Jan 1992
McFarlin, Berhard was hired on 13 Apr 1987
McAlpine, Alejandro was hired on 26 Jun 1991
Billingsley, Breannda was hired on 02 Nov 1987
Herber, Tse was hired on 17 Sep 1985
Peyn, Anoosh was hired on 30 Aug 1991
Leonhardt, Gino was hired on 08 Apr 1989
Jansch, Udi was hired on 20 Nov 1985
Awdeh, Satosi was hired on 18 May 1988
Schusler, Kwee was hired on 26 Feb 1986
Stavenow, Claudi was hired on 04 Mar 1987
Brattka, Charlene was hired on 07 Aug 1987
Bierman, Margareta was hired on 05 Nov 1989
Garigliano, Reuven was hired on 14 Oct 1985
Lipner, Hisao was hired on 01 Oct 1987
Sidou, Hironoby was hired on 21 Jul 1988
McClurg, Shir was hired on 01 Dec 1991
Bernatsky, Mokhtar was hired on 13 Aug 1990
Dolinsky, Gao was hired on 19 Mar 1987
Ritzmann, Erez was hired on 09 Jul 1985
Azuma, Mona was hired on 02 Mar 1990
Mondadori, Danel was hired on 26 May 1987
Gils, Kshitij was hired on 27 Mar 1986
Baek, Premal was hired on 19 Nov 1985
Rosen, Zhongwei was hired on 30 Oct 1986
Lortz, Parviz was hired on 03 Jan 1990
Zockler, Vishv was hired on 31 Mar 1987
Kalloufi, Tuval was hired on 15 Dec 1995
Malabarba, Kenroku was hired on 09 Apr 1994
Foote, Somnath was hired on 16 Feb 1990
Eugenio, Xinglin was hired on 08 Sep 1986
Syrzycki, Jungsoon was hired on 02 Sep 1988
Flasterstein, Sudharsan was hired on 12 Aug 1986
Hofting, Kendra was hired on 14 Mar 1986
Gomatam, Amabile was hired on 18 Nov 1992
Niizuma, Valdiodio was hired on 22 Sep 1989
Desikan, Sailaja was hired on 05 Nov 1996
Ossenbruggen, Arumugam was hired on 18 Apr 1987
Morton, Hilari was hired on 15 Jul 1986
Mandell, Jayson was hired on 14 Jan 1990
Waschkowski, Remzi was hired on 15 Sep 1990
Servieres, Sreekrishna was hired on 13 May 1985
Sullins, Valter was hired on 18 Oct 1988
Haraldson, Hironobu was hired on 21 Sep 1987
Markovitch, Margareta was hired on 01 Jan 1985
Minakawa, Vishwani was hired on 12 Apr 1986
Alpin, Ebru was hired on 01 Jan 1985
Legleitner, Isamu was hired on 14 Jan 1985
Ossenbruggen, Shirish was hired on 01 Jan 1985
Sigstam, Karsten was hired on 04 Aug 1985
Wegerle, Krassimir was hired on 01 Jan 1985
Cools, Rosine was hired on 22 Nov 1985
Kieras, Shem was hired on 14 Oct 1988
Ghazalie, Oscar was hired on 05 Feb 1992
Hagimont, DeForest was hired on 01 Jan 1985
DasSarma, Leon was hired on 21 Oct 1986
Onuegbe, Peternela was hired on 01 Jan 1985
Hofmeyr, Rutger was hired on 07 Jan 1989
Quadeer, Sanjoy was hired on 12 Aug 1986
Pesch, Dung was hired on 09 Jun 1989
Kaelbling, Przemyslawa was hired on 01 Jan 1985
Zhang, Hauke was hired on 30 Dec 1986
Staelin, Arie was hired on 01 Jan 1985
Kambil, Hilary was hired on 31 Jan 1988
Butterworth, Tonny was hired on 01 Jan 1985
Giarratana, Marjo was hired on 12 Feb 1988
Spinelli, Xiaobin was hired on 17 Aug 1991
Weedman, Yuchang was hired on 10 Jul 1989

In [14]:
cursor = cnx.cursor()

query = ("SELECT * FROM departments ")
cursor.execute(query)
departments = pd.DataFrame(list(cursor))

cursor.close()
departments.rename(columns={0: 'dept_no', 1: 'dept_name'})
departments.columns = ['dept_no', 'dept_name']
departments.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [62]:
cursor = cnx.cursor()

query = ("SELECT * FROM dept_emp ")
cursor.execute(query)
employments = pd.DataFrame(list(cursor))

cursor.close()
employments.columns = ['emp_no', 'dept_no', 'from_date', 'to_date']
employments.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [17]:
cursor = cnx.cursor()

query = ("SELECT * FROM dept_manager ")
cursor.execute(query)
management = pd.DataFrame(list(cursor))

cursor.close()
management.columns = ['emp_no', 'dept_no', 'from_date', 'to_date']
management.head()

   emp_no dept_no   from_date     to_date
0  110022    d001  1985-01-01  1991-10-01
1  110039    d001  1991-10-01  9999-01-01
2  110085    d002  1985-01-01  1989-12-17
3  110114    d002  1989-12-17  9999-01-01
4  110183    d003  1985-01-01  1992-03-21

In [18]:
cursor = cnx.cursor()

query = ("SELECT * FROM employees ")
cursor.execute(query)
employees = pd.DataFrame(list(cursor))

cursor.close()
employees.columns = ['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date']
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [19]:
cursor = cnx.cursor()

query = ("SELECT * FROM salaries ")
cursor.execute(query)
jobs = pd.DataFrame(list(cursor))

cursor.close()
jobs.columns = ['emp_no', 'salary', 'from_date', 'to_date']
jobs.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [20]:
cursor = cnx.cursor()

query = ("SELECT * FROM titles ")
cursor.execute(query)
titles = pd.DataFrame(list(cursor))

cursor.close()
titles.columns = ['emp_no', 'title', 'from_date', 'to_date']
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

Transform the dates `9999-01-01` into missing values

In [65]:
def clean_date(r):
    return pd.to_datetime(str(r)) if str(r) != '9999-01-01' else None

In [66]:
employments['to_date'] = employments['to_date'].apply(clean_date)
employments['from_date'] = employments['from_date'].apply(clean_date)
employments.head()

   emp_no dept_no  from_date to_date
0   10001    d005 1986-06-26     NaT
1   10002    d007 1996-08-03     NaT
2   10003    d004 1995-12-03     NaT
3   10004    d004 1986-12-01     NaT
4   10005    d003 1989-09-12     NaT

In [23]:
management['to_date'] = management['to_date'].apply(clean_date)
management['from_date'] = management['from_date'].apply(clean_date)
management.head()

   emp_no dept_no  from_date    to_date
0  110022    d001 1985-01-01 1991-10-01
1  110039    d001 1991-10-01        NaT
2  110085    d002 1985-01-01 1989-12-17
3  110114    d002 1989-12-17        NaT
4  110183    d003 1985-01-01 1992-03-21

In [24]:
employees['hire_date'] = employees['hire_date'].apply(clean_date)
employees['birth_date'] = employees['birth_date'].apply(clean_date)
employees.head()

   emp_no birth_date first_name last_name gender  hire_date
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [25]:
jobs['to_date'] = jobs['to_date'].apply(clean_date)
jobs['from_date'] = jobs['from_date'].apply(clean_date)
jobs.head()

   emp_no  salary  from_date    to_date
0   10001   60117 1986-06-26 1987-06-26
1   10001   62102 1987-06-26 1988-06-25
2   10001   66074 1988-06-25 1989-06-25
3   10001   66596 1989-06-25 1990-06-25
4   10001   66961 1990-06-25 1991-06-25

In [26]:
titles['to_date'] = titles['to_date'].apply(clean_date)
titles['from_date'] = titles['from_date'].apply(clean_date)
titles.head()

   emp_no            title  from_date    to_date
0   10001  Senior Engineer 1986-06-26        NaT
1   10002            Staff 1996-08-03        NaT
2   10003  Senior Engineer 1995-12-03        NaT
3   10004         Engineer 1986-12-01 1995-12-01
4   10004  Senior Engineer 1995-12-01        NaT

## Question 1
Compute the number of employees hired in each year

In [27]:
employees['year'] = employees['hire_date'].dt.year

In [28]:
employees.head()

   emp_no birth_date first_name last_name gender  hire_date  year
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26  1986
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21  1985
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28  1986
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01  1986
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12  1989

In [29]:
employees.groupby('year').size()

year
1985    23
1986    15
1987    15
1988    12
1989    16
1990    12
1991     7
1992     9
1993     3
1994     4
1995     5
1996     1
1997     1
1999     1
dtype: int64

## Question 2
Find the manager who is currently spending more time managing the same department

First, select the current management assignments

In [30]:
current = management[management['to_date'].isnull()]
current

    emp_no dept_no  from_date to_date
1   110039    d001 1991-10-01     NaT
3   110114    d002 1989-12-17     NaT
5   110228    d003 1992-03-21     NaT
9   110420    d004 1996-08-30     NaT
11  110567    d005 1992-04-25     NaT
15  110854    d006 1994-06-28     NaT
17  111133    d007 1991-03-07     NaT
19  111534    d008 1991-04-08     NaT
23  111939    d009 1996-01-03     NaT

Then we can use `idxmin` to extract the manager with the earliest `from_date`

In [31]:
current['from_date'].idxmin()

3

In [32]:
current.loc[current['from_date'].idxmin()]

emp_no                    110114
dept_no                     d002
from_date    1989-12-17 00:00:00
to_date                      NaT
Name: 3, dtype: object

## Question 3
Find the manager who has spent the most time managing the same department

We had a column `duration` that contains the length of each assignment. If the `to_date` is missing, we use the current date

In [71]:
def compute_duration(row):
    if pd.isnull(row[3]):
        return datetime.datetime.now() - row[2]
    else:
        return row[3] - row[2]

In [72]:
management['duration'] = management.apply(compute_duration, axis=1)
management.head()

   emp_no dept_no  from_date    to_date                   duration
0  110022    d001 1985-01-01 1991-10-01         2464 days 00:00:00
1  110039    d001 1991-10-01        NaT  9577 days 06:25:09.653929
2  110085    d002 1985-01-01 1989-12-17         1811 days 00:00:00
3  110114    d002 1989-12-17        NaT 10230 days 06:25:09.654845
4  110183    d003 1985-01-01 1992-03-21         2636 days 00:00:00

Then we can use `idxmax` to extract the manager with the larges duration

In [73]:
management.loc[management['duration'].idxmax()]

emp_no                           110114
dept_no                            d002
from_date           1989-12-17 00:00:00
to_date                             NaT
duration     10230 days 06:25:09.654845
Name: 3, dtype: object

## Question 4
Find the department that has the most employees

In [74]:
current = employments[employments['to_date'].isnull()]
employments

     emp_no dept_no  from_date    to_date
0     10001    d005 1986-06-26        NaT
1     10002    d007 1996-08-03        NaT
2     10003    d004 1995-12-03        NaT
3     10004    d004 1986-12-01        NaT
4     10005    d003 1989-09-12        NaT
5     10006    d005 1990-08-05        NaT
6     10007    d008 1989-02-10        NaT
7     10008    d005 1998-03-11 2000-07-31
8     10009    d006 1985-02-18        NaT
9     10010    d004 1996-11-24 2000-06-26
10    10010    d006 2000-06-26        NaT
11    10011    d009 1990-01-22 1996-11-09
12    10012    d005 1992-12-18        NaT
13    10013    d003 1985-10-20        NaT
14    10014    d005 1993-12-29        NaT
15    10015    d008 1992-09-19 1993-08-22
16    10016    d007 1998-02-11        NaT
17    10017    d001 1993-08-03        NaT
18    10018    d004 1992-07-29        NaT
19    10018    d005 1987-04-03 1992-07-29
20    10019    d008 1999-04-30        NaT
21    10020    d004 1997-12-30        NaT
22    10021    d005 1988-02-10 2002-07-15
23    10022    d005 1999-09-03        NaT
24    10023    d005 1999-09-27        NaT
25    10024    d004 1998-06-14        NaT
26    10025    d005 1987-08-17 1997-10-15
27    10026    d004 1995-03-20        NaT
28    10027    d005 1995-04-02        NaT
29    10028    d005 1991-10-22 1998-04-06
..      ...     ...        ...        ...
104   10096    d004 1999-01-23        NaT
105   10097    d008 1990-09-15        NaT
106   10098    d004 1985-05-13 1989-06-29
107   10098    d009 1989-06-29 1992-12-11
108   10099    d007 1988-10-18        NaT
109   10100    d003 1987-09-21        NaT
110  110022    d001 1985-01-01        NaT
111  110039    d001 1986-04-12        NaT
112  110085    d002 1985-01-01        NaT
113  110114    d002 1985-01-14        NaT
114  110183    d003 1985-01-01        NaT
115  110228    d003 1985-08-04        NaT
116  110303    d004 1985-01-01        NaT
117  110344    d004 1985-11-22        NaT
118  110386    d004 1988-10-14        NaT
119  110420    d004 1992-02-05        NaT
120  110511    d005 1985-01-01        NaT
121  110567    d005 1986-10-21        NaT
122  110725    d006 1985-01-01        NaT
123  110765    d006 1989-01-07        NaT
124  110800    d006 1986-08-12        NaT
125  110854    d006 1989-06-09        NaT
126  111035    d007 1985-01-01        NaT
127  111133    d007 1986-12-30        NaT
128  111400    d008 1985-01-01        NaT
129  111534    d008 1988-01-31        NaT
130  111692    d009 1985-01-01        NaT
131  111784    d009 1988-02-12        NaT
132  111877    d009 1991-08-17        NaT
133  111939    d009 1989-07-10        NaT

[134 rows x 4 columns]

In [75]:
full_empl = pd.merge(current, departments, on = 'dept_no')
full_empl.head()

   emp_no dept_no  from_date to_date    dept_name
0   10001    d005 1986-06-26     NaT  Development
1   10006    d005 1990-08-05     NaT  Development
2   10012    d005 1992-12-18     NaT  Development
3   10014    d005 1993-12-29     NaT  Development
4   10022    d005 1999-09-03     NaT  Development

In [76]:
num_employees = full_empl.groupby('dept_name').size()
num_employees.head()

dept_name
Customer Service     8
Development         24
Finance              3
Human Resources     12
Marketing            4
dtype: int64

In [77]:
num_employees.idxmax()

'Development'

## Question 5
Find the department that has had (now, or in the past) the most employees in any given moment

## Question 6
Find the department that has had (now, or in the past) the most employees (sum all current and past employees).

In [78]:
full_empl = pd.merge(current, departments, on = 'dept_no')
full_empl.head()

   emp_no dept_no  from_date to_date    dept_name
0   10001    d005 1986-06-26     NaT  Development
1   10006    d005 1990-08-05     NaT  Development
2   10012    d005 1992-12-18     NaT  Development
3   10014    d005 1993-12-29     NaT  Development
4   10022    d005 1999-09-03     NaT  Development

In [79]:
num_employees = full_empl.groupby(['dept_name', 'emp_no'], as_index= False).size().groupby(['dept_name'], as_index= False).size()
num_employees.head()

dept_name         emp_no
Customer Service  10038     1
                  10049     1
                  10060     1
                  10088     1
                  111692    1
dtype: int64

## Question 7
Compute how the current salaries are distributed among all departments

For each current job, compute the department.

In [81]:
job_dept = pd.merge(jobs[jobs['to_date'].isnull()], employments, on = 'emp_no')
job_dept.head()

   emp_no  salary from_date_x to_date_x dept_no from_date_y to_date_y
0   10001   88958  2002-06-22       NaT    d005  1986-06-26       NaT
1   10002   72527  2001-08-02       NaT    d007  1996-08-03       NaT
2   10003   43311  2001-12-01       NaT    d004  1995-12-03       NaT
3   10004   74057  2001-11-27       NaT    d004  1986-12-01       NaT
4   10005   94692  2001-09-09       NaT    d003  1989-09-12       NaT

In [82]:
job_dept.groupby('dept_no').sum()['salary']

dept_no
d001     387091
d002     436620
d003     841132
d004    1861600
d005    1816741
d006     651891
d007    1348256
d008     689264
d009     569064
Name: salary, dtype: int64

## Question 8
Find the employee that has earned the most, throughout their career

Compute the overall salary earned by each employee

In [83]:
tot_salary = jobs.groupby('emp_no').sum()
tot_salary.head()

         salary
emp_no
10001   1281612
10002    413127
10003    301212
10004    904196
10005   1134585

In [120]:
emp_salary = pd.merge(tot_salary, employees, right_on='emp_no', left_index=True)

TypeError: merge() got multiple values for argument 'right'

In [121]:
emp_salary.loc[tot_salary['salary'].idxmax()]

NameError: name 'emp_salary' is not defined